#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.mongodbatlas_project.main: Reading...
data.mongodbatlas_project.main: Read complete after 1s [id=688e56db03949b7ad039d7bc]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod]
azurerm_service_plan.main: Refreshing state... [id=/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod/providers/Microsoft.Web/serverFarms/asp-atlaszero-prod]
azurerm_storage_account.dataprotection: Refreshing state... [id=/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod/providers/Microsoft.Storage/storageAccounts/atlaszerodpprod]
azurerm_storage_container.dataprotection: Refreshing state... [id=/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod/providers/Microsoft.Storage/storageAccounts/atlaszerodpprod/blobServices/default/containers/dataprotection-keys]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_linux_web_app.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_web_app" "main" {
      + app_metadata                                   = (known after apply)
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + client_affinity_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + logs                                           = (known after apply)
      + name                                           = "app-atlaszero-prod"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "rg-atlaszero-prod"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account                                = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_backup_restore_enabled         = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # azurerm_linux_web_app.main will be created
  + resource "azurerm_linux_web_app" "main" {
      + app_settings                                   = {
          + "ASPNETCORE_ENVIRONMENT"              = "Production"
          + "DataProtection__StorageContainerUri" = "https://atlaszerodpprod.blob.core.windows.net/dataprotection-keys/keys.xml"
          + "Google__ClientId"                    = (sensitive value)
          + "Google__ClientSecret"                = (sensitive value)
          + "WEBSITE_RUN_FROM_PACKAGE"            = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + name                                           = "app-atlaszero-prod"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-atlaszero-prod"
      + service_plan_id                                = "/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod/providers/Microsoft.Web/serverFarms/asp-atlaszero-prod"
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Environment" = "prod"
          + "Project"     = "atlaszero"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/healthz"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "8.0"
            }
        }
    }

  # azurerm_role_assignment.app_service_storage_blob_data_contributor will be created
  + resource "azurerm_role_assignment" "app_service_storage_blob_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/61d32895-97ec-4263-a6ae-a8690c68f2e3/resourceGroups/rg-atlaszero-prod/providers/Microsoft.Storage/storageAccounts/atlaszerodpprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # mongodbatlas_cluster.main will be created
  + resource "mongodbatlas_cluster" "main" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AZURE"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = (known after apply)
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = (known after apply)
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = (known after apply)
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "atlaszero-prod"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = "688e56db03949b7ad039d7bc"
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "US_EAST_2"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration {
          + change_stream_options_pre_and_post_images_expire_after_seconds = -1
          + default_read_concern                                           = (known after apply)
          + default_write_concern                                          = (known after apply)
          + fail_index_key_too_long                                        = (known after apply)
          + javascript_enabled                                             = false
          + minimum_enabled_tls_protocol                                   = "TLS1_2"
          + no_table_scan                                                  = (known after apply)
          + oplog_size_mb                                                  = (known after apply)
          + sample_refresh_interval_bi_connector                           = (known after apply)
          + sample_size_bi_connector                                       = (known after apply)
          + tls_cipher_config_mode                                         = (known after apply)
          + transaction_lifetime_limit_seconds                             = (known after apply)
        }

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

  # mongodbatlas_database_user.main will be created
  + resource "mongodbatlas_database_user" "main" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = "688e56db03949b7ad039d7bc"
      + x509_type          = "NONE"
        # (1 unchanged attribute hidden)

      + roles {
          + database_name = "atlasZeroDB"
          + role_name     = "dbAdmin"
        }
      + roles {
          + database_name = "atlasZeroDB"
          + role_name     = "readWrite"
        }
    }

  # mongodbatlas_project_ip_access_list.main will be created
  + resource "mongodbatlas_project_ip_access_list" "main" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = "Allow all IPs - prod"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = "688e56db03949b7ad039d7bc"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_service_managed_identity_principal_id = (known after apply)
  + app_service_url                           = (known after apply)
  + mongodb_connection_string                 = (sensitive value)
  + mongodb_project_id                        = "688e56db03949b7ad039d7bc"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @runcodedad, Action: `pull_request`*